<script>
	import Cta from '$lib/components/Cta.svelte';
	import { modalOpen } from '$lib/stores';
	import { page } from '$app/stores';

	function toggleConsult() {
		$modalOpen = !$modalOpen;
	}
</script>

<svelte:head>
	<title>Виза в Сингапур - Оформление визы в Визовом агентстве Москва</title>
	<meta name="description" content="Оформление визы в Сингапур в Визовом агентстве Москва. Полное сопровождение процесса, помощь в сборе документов и быстрое оформление визы для вашего путешествия.">
	<meta name="og:title" content="Виза в Сингапур - Оформление визы в Визовом агентстве Москва">
	<meta name="og:description" content="Планируете поездку в Сингапур? Визовое агентство Москва предлагает профессиональное оформление визы. Быстрое и удобное оформление с полным сопровождением.">
	<meta name="og:url" content="{$page.url.href}">
	<meta name="og:image" content="https://визовое-агентство.москва/logo.svg">
</svelte:head>


<section class="visa-section --margin-bottom">
	<div class="container">
		<div class="visa">
			<div class="visa-mobile visible-mobile">
				<p>Виза <br />в Сингапур</p>
			</div>
			<div class="visa-hero">
				<h1 class="--text-xl">ВИЗА В СУНГАПУР</h1>
				<h2 class="--announce --text-xl">от 15 000 руб<span>*включая консульский сбор</span></h2>
				<div class="visa-hero-info">
					<img src="/singapur-hero.webp" alt="statue of liberty" />
					<div>
						<p>
							Сингапур — небольшой островной город-государство, расположенный на юге Малайского
							полуострова в Юго-Восточной Азии. Его площадь составляет около 719 квадратных
							километров.
						</p>
						<p>
							Мы работаем c юридическими и физическими лицами. Оказываем всестороннюю
							консультационную поддержку. Каждый клиент получает персонального менеджера,
							оповещающего о продвижении дел.
						</p>
						<a href="#docs">какие нужны документы</a>
						<button class="btn-main" on:click={toggleConsult}>Оформить визу</button>
					</div>
				</div>
			</div>
			<div class="visa-additional">
				<h2 class="--text-xl-l">Виза в Сингапур</h2>
				<div class="visa-additional-text">
					<p>
						Сингапур имеет богатую историю, начиная с древних малайских коренных народов. В 19 веке
						он стал ключевым торговым портом Великобритании и частью Британской империи. В 1965 году
						Сингапур обрел независимость и стал самостоятельным государством. Здесь проживает
						многонациональное общество, включающее китайцев, малайцев, индусов и другие этнические
						группы.
					</p>
					<p>
						Сингапур является одним из самых развитых и процветающих государств мира. Его экономика
						основана на финансовых услугах, торговле и высоких технологиях.
					</p>
					<p>
						Несмотря на небольшую площадь, в Сингапуре много природных парков и заповедников. Одним
						из самых известных является Национальный парк Макритчи, где можно увидеть обезьян,
						попугаев и других диких животных.
					</p>
					<p>
						Сингапур привлекает миллионы туристов своими архитектурными достопримечательностями,
						шопингом, культурными мероприятиями и гастрономическим разнообразием. Популярные места,
						такие как Марина-Бей Сэндс, остров Сентоза, ботанический сад Сингапура и многочисленные
						рестораны, привлекают туристов, которые стремятся оформить визу на официальном сайте
						визового центра Сингапура в Москве.
					</p>
				</div>
			</div>
			<div class="visa-list" id="docs">
				<h3 class="--text-xl-l --announce">
					Список документов, необходимых для оформления визы в Испанию
					<span>
						*просьба уточнять в каждом конкретном случае точный список документов у Вашего менеджера
					</span>
				</h3>
				<ul>
					<li>Анкета-опросник</li>
					<li>Согласие на обработку персональных данных</li>
					<li>Цветная фотография заявителя (3.5x4.5), строго на белом фоне, не старше 3 месяцев</li>
					<li>
						Оригинал и Копия действующего паспорта заявителя/ копия страницы с биометрическими
						данными.
					</li>
					<li>
						Копия Формы V39A (письмо -приглашение), подписанное гражданином Сингапура (SC) или
						постоянным резидентом (PR) – если применимо. Не старше 3 месяцев
					</li>
					<li>
						Копия Формы V39A (письмо-приглашение), подписанное Сингапурским бизнес-партнером – если
						применимо. Не старше 3 месяцев
					</li>
					<li>
						Копия письма-приглашения от Сингапурской компании на фирменном бланке – если применимо
					</li>
					<li>
						Подтверждение проживания (например, бронирование отеля с указанием всех гостей); или
						Копия NRIC гражданина Сингапура (SC) /Постоянного резидента (SPR) - спонсора в Сингапуре
						+ Форма V39A
					</li>
					<li>
						Копия договора аренды/купли-продажи квартиры и копия разрешения на работу (Employment
						Pass, S Pass или Work Permit) негражданина Сингапура SC/постоянного резидента SPR-
						спонсора в Сингапуре + приглашение в свободной форме;
					</li>
					<li>Бронирование авиабилетов в обе стороны</li>
					<li>
						Оригинал справки с места работы на фирменном бланке компании с указанием должности и
						ежемесячного оклада, актуальна с момента выдачи 1 месяц.
					</li>
					<li>
						Оригинал справки из учебного заведения (подписанная авторизованным лицом), актуальна с
						момента выдачи 1 месяц.
					</li>
					<li>
						Оригинал выписки с банковского счета с оригинальной печатью и подписью (не он-лайн
						выписка), со сроком действия не более 60 дней, и подтверждающая факт наличия
						достаточного количества денежных средств (Заявители с ИП и ООО могут предоставить
						выписку со счета их компании вместо выписки с личного счета). Заявители, чья поездка
						спонсируется, должны предоставить подтверждение спонсорства: спонсорское письмо и
						выписку со счета спонсора в оригинале. Выступать спонсором может только родственник
						заявителя.
					</li>
					<li>
						Подтверждение места жительства на территории РФ (например, внутренний паспорт для
						граждан РФ); или Подтверждение легального пребывания на территории РФ (вид на
						жительство/патент/рабочая виза/разрешение на работу для иностранцев, проживающих в
						России; действующая виза; штамп УФМС в паспорте при пересечении границы, позволяющий
						иностранным гражданам въехать без визы, но не позволяющий долгосрочно пребывать на
						территории России (если срок менее 90 дней)
					</li>
					<li>Свидетельство о регистрации брака – копия (если применимо).</li>
					<li>
						Доверенность на подачу заявления – при подаче без личного присутствия (Заявители,
						подающие заявления через представителя, должны указать причину на обороте доверенности
						на английском языке, почему не могут подать заявление лично)
					</li>
				</ul>
				<p style="color: #808080;">
					Так же есть возможность оформить визу для детей, пенсионеров и иностранных лиц
				</p>

				<button class="btn-main" on:click={toggleConsult}>Оформить визу</button>
			</div>
			<div class="visa-additional">
				<h2 class="--text-xl-l">Визы в Сингапур</h2>
				<div class="visa-additional-text">
					<p>
						Сингапур — небольшой островной город-государство в Юго-Восточной Азии, расположенный на
						юге Малайского полуострова, с площадью около 719 квадратных километров.
					</p>
					<p>
						Государство имеет долгую историю, начиная с древних малайских коренных народов. В 19
						веке оно стало важным торговым портом Великобритании и частью Британской империи. С 1965
						года Сингапур является независимым государством. Здесь проживает многонациональное
						общество, включающее китайцев, малайцев, индусов и другие этнические группы.
					</p>
					<p>
						Сингапур — одно из самых развитых и процветающих государств мира. Его экономика основана
						на финансовых услугах, торговле и высоких технологиях.
					</p>
					<p>
						Несмотря на небольшие размеры, в Сингапуре много природных парков и заповедников. Один
						из самых известных — Национальный парк Макритчи, где можно увидеть обезьян, попугаев и
						других диких животных.
					</p>
					<p>
						Сингапур привлекает миллионы туристов своими архитектурными достопримечательностями,
						шопингом, культурными мероприятиями и разнообразной кухней. Популярные места, такие как
						Марина-Бей Сэндс, остров Сентоза, ботанический сад Сингапура и многочисленные рестораны,
						привлекают туристов, которые обращаются на официальный сайт визового центра Сингапура в
						Москве, чтобы оформить визу и посетить страну.
					</p>
					<p>
						Визовый центр HOT Visa в Москве поможет вам быстро и без проблем оформить визу в
						Сингапур. Наши специалисты помогут собрать все необходимые документы и минимизируют ваше
						личное участие в процессе. Оставьте заявку на сайте или посетите наш визовый центр в
						Москве!
					</p>
				</div>
			</div>
			<div class="visa-list">
				<h3 class="--text-xl-l --announce">Страховка ВЗР в подарок каждому клиенту</h3>
				<ul>
					<li class="--no-list-style">В минимальный пакет услуг по полису ВЗР входит:</li>
					<li>Госпитализация</li>
					<li>Нахождение в стационаре или амбулаторное лечение (по назначению врача)</li>
					<li>Экстренное медицинское вмешательство</li>
					<li>Транспортировка в Россию при необходимости</li>
				</ul>

				<button class="btn-main" on:click={toggleConsult}>Оформить визу</button>
			</div>
		</div>
	</div>
</section>

<Cta />

<style lang="scss">
	.--announce {
		display: inline;
		span {
			@include fluid-text(16, 13);
			color: #808080;
			letter-spacing: normal;
			vertical-align: top;
			display: inline-block;
			width: 450px;
			margin-left: 20px;
		}

		@include tablet {
			display: flex;
			flex-direction: column;
			gap: 20px;

			span {
				width: 100%;
				margin: 0;
			}
		}
	}
	.visa {
		display: flex;
		flex-direction: column;
		gap: 160px;

		@include tablet {
			gap: 90px;
		}

		p,
		a {
			@include fluid-text(20, 16);
		}

		&-section {
			padding: 200px 0 0 0;

			@include tablet {
				padding: 0;
			}
		}

		&-mobile {
			height: 100dvh;
			background-image: url('/singapur-hero.webp');
			background-position: center center;
			background-size: cover;
			margin-inline: -20px;
			padding: 0 20px;

			padding-top: 100px;

			p {
				font-size: 50px;
				text-transform: uppercase;
				color: #fff;
				line-height: 110%;
			}
		}

		&-hero {
			display: flex;
			flex-direction: column;
			gap: 60px;

			@include tablet {
				border-top: 1px solid #ededed;
				padding-top: 20px;
				margin-top: -30px;
				h1 {
					margin-bottom: -50px;
				}
			}

			&-info {
				display: grid;
				grid-template-columns: 1fr 1fr;
				gap: 60px;

				@include tablet {
					display: flex;
					img {
						display: none;
					}
				}

				div {
					display: flex;
					flex-direction: column;
					gap: 20px;

					a {
						padding-top: 10px;
						text-transform: uppercase;
						text-decoration: underline;

						@include tablet {
							display: none;
						}
					}
					button {
						margin-top: auto;

						@include mobile {
							display: none;
						}
					}
				}
			}
		}

		&-additional {
			display: flex;
			flex-direction: column;
			padding-top: 20px;
			border-top: 1px solid #ededed;
			gap: 90px;

			@include tablet {
				gap: 60px;
			}

			&-text {
				display: grid;
				grid-template-columns: 1fr 1fr;
				grid-template-rows: repeat(auto-fill, minmax(150px, 1fr));
				row-gap: 20px;
				column-gap: 60px;
				align-items: flex-start;

				@include tablet {
					display: flex;
					flex-direction: column;
					gap: 30px;
				}
			}
		}

		&-list {
			display: flex;
			flex-direction: column;
			gap: 90px;
			padding-top: 20px;
			border-top: 1px solid #ededed;

			@include tablet {
				gap: 60px;

				button {
					display: none;
				}
			}

			ul {
				display: flex;
				flex-direction: column;
				gap: 30px;
				width: calc((100% - 60px) / 2);

				@include tablet {
					gap: 20px;
					width: 100%;
				}

				li {
					list-style-type: disc;
					list-style-position: inside;

					@include fluid-text(20, 16);
				}
			}
		}

		&-variants {
			display: flex;
			flex-direction: column;
			gap: 90px;
			padding-top: 20px;
			border-top: 1px solid #ededed;

			@include tablet {
				gap: 60px;

				button {
					display: none;
				}
			}

			&-element {
				display: flex;
				flex-direction: column;
				gap: 40px;
				width: 65%;

				@include tablet {
					gap: 30px;
					width: 100%;
				}

				P {
					text-transform: uppercase;
				}

				div {
					display: flex;
					flex-direction: column;
					gap: 20px;
					p {
						text-transform: none;
					}
				}
			}
		}

		&-text {
			display: flex;
			flex-direction: column;
			gap: 90px;
			padding-top: 20px;
			border-top: 1px solid #ededed;

			@include tablet {
				gap: 60px;

				button {
					display: none;
				}
			}

			p {
				width: 65%;

				@include tablet {
					width: 100%;
				}
			}
		}
	}
</style>
